//=============================================================================
//
// 爆発処理 [explosion.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_EXPLOSION				(256)	// 爆発最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct TExplosion {
	XMFLOAT3	pos;		// 位置
	XMFLOAT2	size;		// 位置
	XMFLOAT4	col;		// 色
	float		width;		// 幅
	float		height;		// 高さ
	int			idxShadow;	// 影ID
	int anim;
	int count;
	bool		use;		// 使用しているかどうか
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitExplosion(void);
void UninitExplosion(void);
void UpdateExplosion(void);
void DrawExplosion(void);

int StartExplosion(XMFLOAT3 pos, XMFLOAT2 size);