//=============================================================================
//
// タイトルシーン処理 [titleScene.cpp]
// Author :
//
//=============================================================================
#include "scene.h"
#include "debugproc.h"
#include "titleUI.h"


//=============================================================================
// コンストラクタ
//=============================================================================
TitleScene::TitleScene()
{
	// タイトルUI初期化
	m_pTitleUI = new TitleUI;
}
//=============================================================================
// デストラクタ
//=============================================================================
TitleScene::~TitleScene()
{
	// タイトルUI終了
	delete m_pTitleUI;
}
//=============================================================================
// 初期化処理
//=============================================================================
HRESULT TitleScene::Init()
{
	HRESULT hr = S_OK;

	// タイトルUI初期化
	m_pTitleUI = new TitleUI;

	return hr;
}
//=============================================================================
// 終了処理
//=============================================================================
void TitleScene::Uninit()
{
	
	// タイトルUI終了
	delete m_pTitleUI;

}
//=============================================================================
// 更新処理
//=============================================================================
void TitleScene::Update()
{
	

	//次のシーンへ移る条件
	if (GetAsyncKeyState(VK_RETURN) & 0x8000)
	{
#if _DEBUG
		StartFadeOut(SCENE_GAME);

#else 
		StartFadeOut(SCENE_STAGE_SELECT);

#endif
		
	}
	

#if _DEBUG
	//デバック用文字列
	PrintDebugProc("****** TitleScene ******\n");
	PrintDebugProc("\n");

#else 

#endif

	// タイトルUI更新
	m_pTitleUI->Update();

}
//=============================================================================
// 描画処理
//=============================================================================
void TitleScene::Draw()
{
	// 2D描画
	// Zバッファ無効(Zチェック無&Z更新無)
	SetZBuffer(false);

	// 3D描画
	// Zバッファ無効(Zチェック無&Z更新無)
	SetZBuffer(true);

	// 2D描画
	// Zバッファ無効(Zチェック無&Z更新無)
	SetZBuffer(false);
	
	// タイトルUI描画
	m_pTitleUI->Draw();
	
}