//=============================================================================
//
// タイトルUI処理 [titleUI.h]
// Author : 鈴木拓巳
//
//=============================================================================
#pragma once

#include "main.h"
#include "fade.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitleBG(void);
void UninitTitleBG(void);
void UpdateTitleBG(void);
void DrawTitleBG(void);
